# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],                  # 0-P1/2

   [-1, 1, Conv, [128, 3, 2]],                    # 1-P2/4
   [-1, 3, C3, [128]],                            # 2

   [-1, 1, Conv, [256, 3, 2]],                    # 3
   [-1, 6, C3, [256]],                            # 4
#   [-1, 1, Cat_Conv, [256, 1]],                   # 5-RGBT-P3/8
   [-1, 1, TargetAwareFusion, [256, 1]],         # 5-RGBT-P3/8

   [-1, 1, Conv, [512, 3, 2]],                     # 6
   [-1, 9, C3, [512]],                            # 7
#   [-1, 1, Cat_Conv, [512, 2]],                   # 8-RGBT-P4/16
   [-1, 1, TargetAwareFusion, [512, 2]],         # 8-RGBT-P4/16

   [-1, 1, Conv, [1024, 3, 2]],                    # 9
   [-1, 3, C3, [1024]],                           # 10
#   [-1, 1, Cat_Conv, [1024, 3]],                  # 11-RGBT-P5/32
   [-1, 1, TargetAwareFusion, [1024, 3]],        # 11-RGBT-P5/32

   [-1, 1, SPPF, [1024, 5]],                      # 12
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                    # 13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 14
   [[-1, 8], 1, Concat, [1]],                     # 15 cat backbone P4
   [-1, 3, C3, [512, False]],                     # 16

   [-1, 1, Conv, [256, 1, 1]],                    # 17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 18
   [[-1, 5], 1, Concat, [1]],                     # 19 cat backbone P3
   [-1, 3, C3, [256, False]],                     # 20 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],                    # 21
   [[-1, 17], 1, Concat, [1]],                    # 22 cat head P4
   [-1, 3, C3, [512, False]],                     # 23 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],                    # 24
   [[-1, 13], 1, Concat, [1]],                    # 25 cat head P5
   [-1, 3, C3, [1024, False]],                    # 26 (P5/32-large)

   [[20, 23, 26], 1, Detect, [nc, anchors]],      # 27 Detect(P3, P4, P5)
  ]
